import re
from collections import OrderedDict
from collections.abc import Callable
from pathlib import Path
from unittest.mock import patch

import pytest

from wikidict import context
from wikidict.render import parse_word
from wikidict.stubs import Definitions

LANG = __name__.split("_", 1)[1]


@pytest.fixture(scope="module", autouse=True)
def setup_lua_ctx() -> None:
    with patch.dict("os.environ", {"CWD": str(Path(context.__file__).parent.parent)}):
        assert context.reset(LANG)


@pytest.mark.parametrize(
    "word, pronunciations, etymology, definitions, variants, reverse_variants",
    [
        (
            "альбом",
            [],
            [],
            {
                "Значення|ч.": [
                    "книга або зошит з чистими листками для малювання, вписування віршів, зберігання фотографій, листівок, марок та ін.",
                    "об'єднане за темою видання або збірка репродукцій картин, малюнків, фотографій та ін., оправлених разом або вміщених в одну папку.",
                ]
            },
            [],
            [
                "альбомам",
                "альбомами",
                "альбомах",
                "альбоме",
                "альбоми",
                "альбомові",
                "альбомом",
                "альбому",
                "альбомі",
                "альбомів",
            ],
        ),
        (
            "альбомчик",
            [],
            [],
            {},
            ["альбом"],
            [
                "альбомчика",
                "альбомчикам",
                "альбомчиками",
                "альбомчиках",
                "альбомчики",
                "альбомчикові",
                "альбомчиком",
                "альбомчику",
                "альбомчиків",
            ],
        ),
        (
            "Бобрик",
            ["[bɔbrek]", "[ˈbɔbrek]"],
            [],
            {
                "Значення|ч.": [
                    "назва декількох населених пунктів в Україні.",
                    "українське прізвище.",
                    "<i>геогр.</i> річка в Україні Сумської області",
                ]
            },
            [],
            ["Бобрика", "Бобрикам", "Бобриками", "Бобриках", "Бобрики", "Бобрикові", "Бобриком", "Бобрику", "Бобриків"],
        ),
        (
            "вимовляти",
            ["[ʋemɔu̯ˈlʲɑte]"],
            [],
            {
                "Значення": [
                    "передавати голосом звуки, слова своєї або чужої мови; говорити певним чином.",
                    "говорити що-небудь, промовляти.",
                    ("Висловлювати думку, враження, почуття.",),
                ]
            },
            [],
            [
                "вимовлявши",
                "вимовлятиме",
                "вимовлятимемо",
                "вимовлятимете",
                "вимовлятимеш",
                "вимовлятиму",
                "вимовлятимуть",
                "вимовляю",
                "вимовляють",
                "вимовляючи",
                "вимовляє",
                "вимовляємо",
                "вимовляєте",
                "вимовляєш",
            ],
        ),
        (
            "анонсувати",
            [],
            [],
            {"Значення": ["робити анонс про що-небудь; оголошувати."]},
            [],
            [
                "анонсовании",
                "анонсовано",
                "анонсувавши",
                "анонсуватиме",
                "анонсуватимемо",
                "анонсуватимете",
                "анонсуватимеш",
                "анонсуватиму",
                "анонсуватимуть",
                "анонсую",
                "анонсують",
                "анонсуючи",
                "анонсує",
                "анонсуємо",
                "анонсуєте",
                "анонсуєш",
            ],
        ),
        (
            "Грушки",
            [],
            [],
            {"Значення": ["<i>геогр.</i> назва кількох населених пунктів в Україні"]},
            [],
            ["Грушкам", "Грушками", "Грушках", "Грушків", "Грушок"],
        ),
        (
            "стуляти",
            [],
            [],
            {
                "Значення": [
                    "наближаючи впритул одне до одного, щільно з'єднувати <i>(предмети або краї предметів)</i>",
                    "з'єднувати докупи частини чого-небудь",
                    "складати що-небудь розкрите, розгорнуте; закривати",
                    "закривати, змикати",
                ]
            },
            [],
            [
                "стулимо",
                "стулите",
                "стулить",
                "стулиш",
                "стулю",
                "стулявши",
                "стуляно",
                "стулятиме",
                "стулятимемо",
                "стулятимете",
                "стулятимеш",
                "стулятиму",
                "стулятимуть",
                "стулять",
                "стулячи",
            ],
        ),
        (
            "бур",
            ["[bur]", "[ˈburɪ]"],
            [],
            {
                "Значення|ч.": [
                    "Інструмент для буріння свердловин у ґрунті та різних гірських породах.",
                    "<i>тільки мн.</i> Народність у Південній Африці, нащадки європейських (головним чином голландських) колоністів.",
                    "Представник цієї народності.",
                ],
                "Синоніми|ч.": ["лопатень, свердел, свердло", "африканери", "африкандер, африканер"],
            },
            [],
            ["бура", "бурам", "бурами", "бурах", "буре", "бури", "бурові", "буром", "буру", "бурі", "бурів"],
        ),
        (
            "вірогідний",
            ["[ˌvʲirɔˈɦʲidnɨj ̊]", "[ˌwiroˈɦidnɪ̞ɪ̯]"],
            [
                "Калька рос. <i>достоверный</i> &lt; церк.-слов. <i>достоинъ вѣры</i> (<i>гідний віри</i>).",
                "Сплутування з рос. <i>вероятный</i> (<i>імовірний</i>) через подібну вимову.",
            ],
            {
                "Значення": [
                    "<i>книжн.</i> (той, такий,) якому можна вірити, певний",
                    "<i>помилк.</i> більш-менш певний, якоюсь мірою певний, імовірний",
                ],
                "Синоніми": ["певний", "більш-менш певний, якоюсь мірою певний, імовірний"],
            },
            [],
            [],
        ),
    ],
)
def test_parse_word(
    word: str,
    pronunciations: list[str],
    etymology: list[Definitions],
    definitions: Definitions,
    variants: list[str],
    reverse_variants: list[str],
    page: Callable[[str, str], str],
) -> None:
    """Test the sections finder and definitions getter."""
    code = page(word, LANG)

    # Needs specific transformations before hand (they are done in --parse & --get-word, but this is not a taken path by the test)
    # `{{=uk=|{{PAGENAME}}}}` → `=uk=`
    code = re.sub(r"^\{\{=(\w+)=\|\{\{PAGENAME\}\}\}\}", r"=\1=", code, flags=re.MULTILINE)
    # `{{=uk=}}` → `=uk=`
    code = re.sub(r"^\{\{=(\w+)=\}\}", r"=\1=", code, flags=re.MULTILINE)

    details = parse_word(word, code, LANG, force=True)
    assert details
    assert pronunciations == details.pronunciations
    assert etymology == details.etymology
    assert OrderedDict(definitions) == details.definitions
    assert variants == details.variants
    assert reverse_variants == details.reverse_variants
