from collections import defaultdict


def render_variant(tpl: str, parts: list[str], data: defaultdict[str, str], word: str) -> str:
    """
    >>> render_variant("ουδ του-πτώσειςΟΑΚεν", ["επίπεδος"], defaultdict(str), "επίπεδο")
    'επίπεδος'
    >>> render_variant("ουδ του-πτώσειςΟΑΚπλ", ["-άδικος"], defaultdict(str), "-άδικο")
    '-άδικος'
    >>> render_variant("ουδ του-πτώσηΓεν", ["έβδομος"], defaultdict(str), "έβδομου")
    'έβδομος'
    >>> render_variant("ουδ του-πτώσηΓπλ", ["έβδομος"], defaultdict(str), "έβδομου")
    'έβδομος'

    >>> render_variant("αρσ του-πτώσηΓεν", ["έβδομος"], defaultdict(str), "έβδομου")
    'έβδομος'
    >>> render_variant("αρσ του-πτώσηΓπλ", ["έβδομος"], defaultdict(str), "έβδομων")
    'έβδομος'

    >>> render_variant("πτώσειςΟΑΚπλ", ["Ελληνούπολη"], defaultdict(str), "Ελληνουπόλεις")
    'Ελληνούπολη'

    >>> render_variant("πτώσηΑεν", ["επίπεδος"], defaultdict(str), "επίπεδο")
    'επίπεδος'

    >>> render_variant("θηλ του", ["τσιγγάνος"], defaultdict(str), "τσιγγάνα")
    'τσιγγάνος'
    >>> render_variant("θηλ του-πτώσειςΟΑΚπλ", ["έγγαμος"], defaultdict(str), "έγγαμες")
    'έγγαμος'

    >>> render_variant("απαρ", ["ενεστώτα", "miror"], defaultdict(str), "Μιρέλλα")
    'miror'
    >>> render_variant("απαρ", ["ενεστώτα", "miror", "en", "foo"], defaultdict(str), "Μιρέλλα")
    'miror'
    """
    return parts[1] if tpl == "απαρ" else parts[-1] if parts else word


handlers = {
    **dict.fromkeys(
        {
            "ρημ τύπος",
            "ρημ_τύπος",
            "θηλ του",
            "θηλ_του",
            "θηλυκό του",
            "θηλυκό_του",
            "θηλ του-πτώσειςΟΑΚεν",
            "θηλ_του-πτώσειςΟΑΚεν",
            "θηλ του-πτώσηΓπλ",
            "θηλ_του-πτώσηΓπλ",
            "θηλ του-πτώσειςΟΑΚπλ",
            "θηλ_του-πτώσειςΟΑΚπλ",
            "θηλ του-πτώσηΓεν",
            "θηλ_του-πτώσηΓεν",
            "θηλ του-πτώσειςΟΚεν",
            "θηλ_του-πτώσειςΟΚεν",
            "ουδ του",
            "ουδ_του",
            "ουδ του-πτώσειςΟΑΚεν",
            "ουδ_του-πτώσειςΟΑΚεν",
            "ουδ του-πτώσειςΟΑΚπλ",
            "ουδ_του-πτώσειςΟΑΚπλ",
            "ουδ του-πτώσηΓπλ",
            "ουδ_του-πτώσηΓπλ",
            "ουδ του-πτώσηΓεν",
            "ουδ_του-πτώσηΓεν",
            "αρσ του",
            "αρσ_του",
            "αρσ του-πτώσηΓεν",
            "αρσ_του-πτώσηΓεν",
            "αρσ του-πτώσηΓπλ",
            "αρσ_του-πτώσηΓπλ",
            "αρσ του-πτώσηΑεν",
            "αρσ_του-πτώσηΑεν",
            "πτώση",
            "πτώσηΔεν",
            "πτώσηΑπλ",
            "πτώσηΓπλ",
            "πτώσηΑεν",
            "πτώσηΚεν",
            "πτώσηΓεν",
            "πτώσεις",
            "πτώσειςΟΑΚπλ",
            "πτώσειςΟΚπλ",
            "πτώσειςΓΑΚεν",
            "πτώσειςΟΑΚεν",
            "πληθ_του",
            "πληθυντικός του",
            "κλ",
            "απαρ",
            "πλ",
            "infl",
        },
        render_variant,
    ),
}
