# Details found on # https://ru.wiktionary.org/wiki/Шаблон:TPL
from contextlib import suppress

BASES = {
    "прил ru 1*a": (
        ["", "ый", "ого", "ому", "ым", "ом", "ое", "о", "ая", "ой", "ую", "ою", "а", "ые", "ых", "ыми", "ы"],
        [2, *[1] * 16],
    ),
    "прил ru 1*a(1)": (
        ["", "ый", "ого", "ому", "ым", "ом", "ое", "о", "ая", "ой", "ую", "ою", "а", "ые", "ых", "ыми", "ы"],
        [2, *[1] * 16],
    ),
    "прил ru 1*a((1))": (
        ["", "ен", "ый", "ого", "ому", "ым", "ом", "ое", "о", "ая", "ой", "ую", "ою", "а", "ые", "ых", "ыми", "ы"],
        [2, 2, *[1] * 16],
    ),
    "прил ru 1*a-": (
        ["ый", "ого", "ому", "ым", "ом", "ое", "ая", "ой", "ую", "ою", "ые", "ых", "ыми"],
        [1] * 13,
    ),
    "прил ru 1a": (
        ["ый", "ого", "ому", "ым", "ом", "ое", "ая", "ой", "ую", "ою", "ые", "ых", "ым", "ыми"],
        [1] * 14,
    ),
    "прил ru 2a": (
        ["ий", "его", "ему", "им", "ем", "ь", "ее", "яя", "ей", "юю", "я", "ие", "их", "ими"],
        [1] * 14,
    ),
    "прил ru 3a": (
        [
            "ий",
            "ого",
            "ому",
            "им",
            "ом",
            "ое",
            "ого",
            "ому",
            "о",
            "ая",
            "ой",
            "ую",
            "ою",
            "а",
            "ие",
            "их",
            "ими",
        ],
        [1] * 17,
    ),
    "прил ru 3*aX~": (
        ["", "ий", "ого", "ому", "ий", "им", "ом", "ое", "о", "ая", "ой", "ую", "ою", "а", "ие", "их", "ими"],
        [2, *[1] * 16],
    ),
    "прил ru 3aX~": (
        ["ий", "ого", "ому", "ий", "им", "ом", "ое", "ая", "ой", "ую", "ою", "ие", "их", "ими"],
        [1] * 14,
    ),
    "прил ru 4a": (
        ["ий", "его", "ему", "ий", "им", "ем", "ее", "ая", "ей", "ую", "ею", "ие", "их", "ими"],
        [1] * 14,
    ),
    "прил ru 5a": (
        [
            "ый",
            "его",
            "ему",
            "ым",
            "ем",
            "ее",
            "е",
            "ая",
            "ей",
            "ую",
            "ею",
            "а",
            "ые",
            "ым",
            "ых",
            "ыми",
            "ы",
        ],
        [1] * 17,
    ),
    "прил ru 6a": (
        ["ий", "его", "ему", "им", "ем", "ее", "яя", "ей", "юю", "ею", "ие", "их", "ими"],
        [1] * 13,
    ),
    "прил ru 1b": (
        ["о́й", "о́го", "о́му", "ы́м", "о́м", "о́е", "а́я", "у́ю", "о́ю", "ы́е", "ы́х", "ы́м", "ы́ми", "ы́"],
        [1] * 14,
    ),
    "прил ru 1bX": (
        ["о́й", "о́го", "о́му", "ы́м", "о́м", "о́е", "о́", "а́я", "у́ю", "о́ю", "а́", "ы́е", "ы́х", "ы́м", "ы́ми"],
        [1] * 15,
    ),
    "прил ru 3b": (
        ["о́й", "о́го", "о́му", "и́м", "о́м", "о́е", "а́я", "у́ю", "о́ю", "и́е", "и́х", "и́ми"],
        [1] * 12,
    ),
    "прил ru 4b": (
        ["о́й", "о́го", "о́му", "и́м", "о́м", "о́е", "а́я", "у́ю", "о́ю", "и́е", "и́х", "и́ми"],
        [1] * 12,
    ),
    "прил ru (мс 6*a)": (
        ["ий", "ьего", "ьему", "ьим", "ьем", "ье", "ья", "ьей", "ью", "ьею", "ьи", "ьих", "ьими"],
        [1] * 13,
    ),
    "сущ ru f a 0": ([""], [1]),
    "сущ ru f a 1*a": (
        ["", "а", "ы", "е", "у", "ой", "ою", "ам", "ами", "ах"],
        [2, *[1] * 9],
    ),
    "сущ ru f a 1a": (
        ["", "а", "ы", "е", "у", "ой", "ою", "ам", "ами", "ах"],
        [1] * 10,
    ),
    "сущ ru f a 2a": (
        ["я", "и", "е", "ю", "ей", "ею", "ь", "ям", "ями", "ях"],
        [1] * 10,
    ),
    "сущ ru f a 2*a-ня": (
        ["", "я", "и", "е", "ю", "ей", "ею", "е", "ям", "ями", "ях"],
        [2, *[1] * 10],
    ),
    "сущ ru f a 3*a": (
        ["а", "и", "е", "у", "ой", "ою", "ам", "ами", "ах", ""],
        [*[1] * 9, 2],
    ),
    "сущ ru f a 3a": (
        ["", "а", "и", "е", "у", "ой", "ою", "ам", "ами", "ах"],
        [1] * 10,
    ),
    "сущ ru f a 4a": (
        ["", "а", "и", "е", "у", "ей", "ею", "ам", "ами", "ах"],
        [1] * 10,
    ),
    "сущ ru f a 5a": (
        ["", "а", "ы", "е", "у", "ей", "ею", "ам", "ами", "ам"],
        [1] * 10,
    ),
    "сущ ru f a 6a": (
        ["я", "и", "е", "ю", "ей", "ею", "ям", "ями", "ях"],
        [1] * 9,
    ),
    "сущ ru f a 7a": (
        ["я", "и", "ю", "ей", "ею", "й", "ям", "ями", "ях"],
        [1] * 9,
    ),
    "сущ ru f a 8a": (
        ["ь", "и", "ью", "ию", "ей", "ям", "ями", "ях"],
        [1] * 8,
    ),
    "сущ ru f a 1b": (
        ["", "а́", "ы́", "е́", "у́", "о́й", "о́ю", "а́м", "а́ми", "а́х"],
        [2, *[1] * 9],
    ),
    "сущ ru f ina 1b": (  # No override
        ["", "а́", "ы́", "е́", "у́", "о́й", "о́ю", "а́м", "а́ми", "а́х"],
        [1] * 10,
    ),
    "сущ ru f a 2b": (
        ["я́", "и́", "е́", "ю́", "ёй", "ёю", "е́й", "я́м", "я́ми", "я́х"],
        [1] * 10,
    ),
    "сущ ru f a 3b": (
        ["", "а́", "и́", "е́", "у́", "о́й", "о́ю", "а́м", "а́ми", "а́х"],
        [2, *[1] * 9],
    ),
    "сущ ru f a 4b": (
        ["а́", "и́", "е́", "у́", "о́й", "о́ю", "е́й", "а́м", "а́ми", "а́х"],
        [1] * 10,
    ),
    "сущ ru f a 5b": (
        ["", "а́", "ы́", "е́", "у́", "о́й", "о́ю", "а́м", "а́ми", "а́х"],
        [2, *[1] * 9],
    ),
    "сущ ru f a 6b": (
        ["й", "я́", "и́", "е́", "ю́", "ей", "ёю", "я́м", "я́ми", "я́х"],
        [2, *[1] * 9],
    ),
    "сущ ru f a 1d": (
        ["а́", "ы́", "е́", "у́", "о́й", "о́ю", "", "ы́", "ам", "ами", "ах"],
        [*[1] * 6, *[2] * 5],
    ),
    "сущ ru f a 3d": (
        ["а́", "и́", "е́", "у́", "о́й", "о́ю", "", "и", "ам", "ами", "ах"],
        [*[1] * 6, *[2] * 5],
    ),
    "сущ ru f a 6d": (
        ["а́", "и́", "е́", "ю́", "ёй", "ёю", "и", "й", "ям", "ями", "ях"],
        [*[1] * 6, *[2] * 5],
    ),
    "сущ ru f a 1f": (
        ["а́", "ы́", "е́", "у́", "о́й", "о́ю", "а́м", "а́ми", "а́х", "ы", ""],
        [*[1] * 9, 2, 3],
    ),
    "сущ ru f a 3f": (
        ["а́", "и́", "е́", "у́", "о́й", "о́ю", "а́м", "а́ми", "а́х", "и", ""],
        [*[1] * 9, 2, 3],
    ),
    "сущ ru m a 0": ([""], [1]),
    "сущ ru m a 1°a": (
        ["", "а", "у", "ом", "е", "", "е", "ам", "ами", "ах"],
        [*[1] * 5, *[2] * 5],
    ),
    "сущ ru m a 1a": (
        ["", "а", "у", "ом", "е", "ы", "ов", "ам", "ами", "ах"],
        [1] * 10,
    ),
    "сущ ru m a 2a": (
        ["ь", "я", "ю", "ем", "е", "и", "ей", "ям", "ями", "ях"],
        [1] * 10,
    ),
    "сущ ru m a 3*a": (
        ["", "а", "у", "ом", "е", "и", "ов", "ам", "ами", "ах"],
        [1, *[2] * 9],
    ),
    "сущ ru m a 3a": (
        ["", "а", "у", "ом", "е", "и", "ов", "ам", "ами", "ах"],
        [1] * 10,
    ),
    "сущ ru m a 4a": (
        ["", "а", "у", "ом", "е", "и", "ей", "ам", "ами", "ах"],
        [1] * 10,
    ),
    "сущ ru m a 5a": (
        ["", "а", "у", "ем", "е", "ы", "ев", "ам", "ами", "ах"],
        [1] * 10,
    ),
    "сущ ru m a 6a": (
        ["й", "я", "ю", "ем", "е", "и", "ев", "ям", "ями", "ях"],
        [1] * 10,
    ),
    "сущ ru m a 7a": (
        ["й", "я", "ю", "ем", "и", "ев", "ям", "ями", "ях"],
        [1] * 9,
    ),
    "сущ ru m a 1b": (
        ["", "а́", "у́", "о́м", "е́", "ы́", "о́в", "а́м", "а́ми", "а́х"],
        [1, *[2] * 9],
    ),
    "сущ ru m a 2b": (
        ["ь", "ю́", "я́", "ём", "е́", "е́й", "я́м", "я́ми", "я́х"],
        [1, *[2] * 8],
    ),
    "сущ ru m a 3*b": (
        ["", "а́", "у́", "о́м", "е́", "и́", "о́в", "а́м", "а́ми", "а́х"],
        [1, *[2] * 9],
    ),
    "сущ ru m a 3b": (
        ["", "а́", "у́", "о́м", "е́", "и́", "о́в", "а́м", "а́ми", "а́х"],
        [1, *[2] * 9],
    ),
    "сущ ru m a 4b": (
        ["", "а́", "у́", "о́м", "е́", "и́", "е́й", "а́м", "а́ми", "а́х"],
        [1, *[2] * 9],
    ),
    "сущ ru m a 5*a": (
        ["", "а", "у", "ем", "е", "ы", "ев", "ам", "ами", "ах"],
        [1, *[2] * 9],
    ),
    "сущ ru m a 5b": (
        ["", "а́", "у́", "о́м", "е́", "ы́", "о́в", "а́м", "а́ми", "а́х"],
        [1, *[2] * 9],
    ),
    "сущ ru m a 6b": (
        ["й", "я́", "ю́", "ём", "е́", "й", "ёв", "я́м", "я́ми", "я́х"],
        [1, *[2] * 9],
    ),
    "сущ ru m a 1c": (
        ["", "а", "у", "ом", "е", "ы́", "о́в", "а́м", "а́ми", "а́х"],
        [*[1] * 5, *[2] * 5],
    ),
    "сущ ru m a 2c": (
        ["ь", "я", "ю", "ем", "е", "я́", "е́й", "я́м", "я́ми", "я́х"],
        [*[1] * 5, *[2] * 5],
    ),
    "сущ ru m a 4c": (
        ["", "а", "у", "ем", "е", "и́", "е́й", "а́м", "а́ми", "а́х"],
        [*[1] * 5, *[2] * 5],
    ),
    "сущ ru m a 6c": (
        ["й", "я", "ю", "ем", "е", "и́", "ёв", "я́м", "я́ми", "я́х"],
        [*[1] * 5, *[2] * 5],
    ),
    "сущ ru m a 3d": (
        ["", "и", "ов", "ам", "ами", "ах", "а́", "у́", "о́м", "е́"],
        [*[1] * 6, *[2] * 4],
    ),
    "сущ ru m a 2f": (
        ["ь", "и", "я́", "ю́", "ём", "е́", "е́й", "я́м", "я́ми", "я́х"],
        [*[1] * 2, *[2] * 8],
    ),
    "сущ ru n a 0": ([""], [1]),
    "сущ ru n a 1a": (
        ["", "о", "а", "у", "ом", "е", "ам", "ами", "ах"],
        [1] * 9,
    ),
    "сущ ru n a 4a": (
        ["", "е", "а", "у", "ем", "ам", "ами", "ах"],
        [1] * 8,
    ),
    "сущ ru n a 5a": (
        ["", "е", "а", "у", "ем", "ам", "ами", "ах"],
        [1] * 8,
    ),
    "сущ ru n a 6*a": (
        ["ье", "ья", "ью", "ье", "ьем", "ий", "ьям", "ьями", "ьях"],
        [1] * 9,
    ),
    "сущ ru n a 7a": (
        ["ие", "ия", "ию", "ием", "ии", "ий", "иям", "иями", "иях"],
        [1] * 9,
    ),
    "сущ ru n a 1b": (
        ["о́", "а́", "у́", "о́м", "е́", "а́м", "а́ми", "а́х", ""],
        [*[1] * 8, 2],
    ),
    "сущ ru n a 2b": (
        ["ё", "я́", "ю́", "ё", "ём", "е́", "е́й", "я́м", "я́ми", "я́х"],
        [1] * 10,
    ),
    "сущ ru n a 1d": (
        ["о́", "а́", "у́", "о́м", "е́", "", "а", "ам", "ами", "ах"],
        [*[1] * 5, *[2] * 5],
    ),
    "сущ ru n a 5d": (
        ["о́", "а́", "у́", "о́м", "е́", "", "а", "ам", "ами", "ах"],
        [*[1] * 5, *[2] * 5],
    ),
}

for char in "fmn":
    BASES[f"сущ ru {char} ina 0"] = BASES[f"сущ ru {char} a 0"]

_ina_bases = {}

for base, data in BASES.items():
    to_add = base.replace(" a ", " ina ")
    if to_add in BASES:
        # Prevent override
        continue

    with suppress(KeyError):
        _ina_bases[to_add] = data

BASES |= _ina_bases
del _ina_bases
